#استخدام الدالة print() في بايثون

#يمكن استخدام الدالة print() في بايثون لتعريض رسالة أو قيمة على الشاشة.



#يمكن استخدام الدالة print() لتعريض قيمة متغير أو دالة أو تعريف أو أي قيمة أخرى.
#يمكن استخدام علامة الفاصل ، لتعريض أكثر من قيمة على السطر نفسه.
#يمكن استخدام علامة الفاصل \n لتعريض قيمة على سطر جديد.
##python



# قراءة مدخل من المستخدم
y = input("من فضلك أدخل اسمك: ")
x = int(input("من فضلك أدخل عمرك: "))

# تعريض رسالة تحتوي على اسم المستخدم وعمره
print("مرحباً" + "، اسمك" + y + "، عمرك" + str(x) + "سنة!")