#شروط (if) في بايثون

#يمكن استخدام شروط (if) في بايثون لتحقق مما إذا كان هناك شرط معين صحيح أو خطأ.

#مثال برنامج




# قراءة مدخل من المستخدم
العدد = int(input("من فضلك أدخل رقمًا: "))

# استخدام جملة شرطية if للتحقق مما إذا كان الرقم أكبر من 10
if العدد > 10:
    print("الرقم أكبر من 10")
else:
    print("الرقم أقل أو يساوي 10")
#في هذا المثال، البرنامج يطلب من المستخدم إدخال رقم، ثم يستخدم جملة شرطية if للتحقق مما إذا كان الرقم أكبر من 10. إذا كان الرقم أكبر من 10، فسيتم طباعة رسالة "الرقم أكبر من 10". إذا كان الرقم أقل أو يساوي 10، فسيتم طباعة رسالة "الرقم أقل أو يساوي 10".

#تنويه

#يمكن استخدام علامة الفاصل : لتحديد بداية جملة شرطية.
#يمكن استخدام جملة شرطية if لتحديد ما إذا كانت هناك قيمة معينة صحيحة أو خطأ.
#1يمكن استخدام جملة شرطية if لتحديد ما إذا كانت هناك قيمة معينة أكبر أو أقل من قيمة أخرى.